IDEA Open Model
RebarPatternBase.EndPosition Property
Compatible with IDEA StatiCa 20.1
 This defines end position of the pattern. It is the distance from the start point of the group. Its value should be in corelation to PositionMode
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public double EndPosition { get; set; }
Public Property EndPosition As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarPatternBase Class
IdeaRS.OpenModel.Model Namespace